; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v2 - type_2 ?v5 - type_1)
 	      (pred_1 ?v7 - object ?v5 - type_1)
	      (pred_3 ?v2 - type_2 ?v6 - type_3)
	      (pred_4 ?v2 - type_2 ?v7 - object ?v6 - type_3))

   (:action op_1
       :parameters  (?v2 - type_2 ?v1 ?v8 - type_1)
       :precondition (and  (pred_2 ?v2 ?v1))
       :effect (and  (pred_2 ?v2 ?v8)
		     (not (pred_2 ?v2 ?v1))))

   (:action op_3
       :parameters (?v2 - type_2 ?v4 - object ?v3 - type_1 ?v6 - type_3)
       :precondition  (and  (pred_1 ?v4 ?v3) (pred_2 ?v2 ?v3) (pred_3 ?v2 ?v6))
       :effect (and (pred_4 ?v2 ?v4 ?v6)
		    (not (pred_1 ?v4 ?v3)) 
		    (not (pred_3 ?v2 ?v6))))

   (:action op_2
       :parameters (?v2 - type_2 ?v4 - object ?v3 - type_1 ?v6 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v4 ?v6) (pred_2 ?v2 ?v3))
       :effect (and (pred_1 ?v4 ?v3)
		    (pred_3 ?v2 ?v6)
		    (not (pred_4 ?v2 ?v4 ?v6)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_01 - type_2
obj_04 obj_03 - type_3
obj_05 obj_07 obj_08 - type_1
obj_09 obj_06 obj_02 - object)
(:init
(pred_2 obj_01 obj_08)
(pred_3 obj_01 obj_04)
(pred_3 obj_01 obj_03)
(pred_1 obj_09 obj_07)
(pred_1 obj_06 obj_05)
(pred_1 obj_02 obj_08)
)
(:goal
(and
(pred_1 obj_09 obj_05)
(pred_1 obj_06 obj_07)
(pred_1 obj_02 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_01 ?b obj_04))))
)
)

; plan
1. (op_3 obj_01 obj_02 obj_08 obj_03)
   deleted: (pred_1 obj_02 obj_08) (pred_3 obj_01 obj_03)
   added: (pred_4 obj_01 obj_02 obj_03)
   goals met: 0 of 3
2. (op_1 obj_01 obj_08 obj_05)
   deleted: (pred_2 obj_01 obj_08)
   added: (pred_2 obj_01 obj_05)
   goals met: 0 of 3
3. (op_2 obj_01 obj_02 obj_05 obj_03)
   deleted: (pred_4 obj_01 obj_02 obj_03)
   added: (pred_1 obj_02 obj_05) (pred_3 obj_01 obj_03)
   goals met: 1 of 3
4. (op_3 obj_01 obj_06 obj_05 obj_03)
   deleted: (pred_1 obj_06 obj_05) (pred_3 obj_01 obj_03)
   added: (pred_4 obj_01 obj_06 obj_03)
   goals met: 1 of 3
5. (op_1 obj_01 obj_05 obj_07)
   deleted: (pred_2 obj_01 obj_05)
   added: (pred_2 obj_01 obj_07)
   goals met: 1 of 3
6. (op_2 obj_01 obj_06 obj_07 obj_03)
   deleted: (pred_4 obj_01 obj_06 obj_03)
   added: (pred_1 obj_06 obj_07) (pred_3 obj_01 obj_03)
   goals met: 2 of 3
7. (op_3 obj_01 obj_09 obj_07 obj_03)
   deleted: (pred_1 obj_09 obj_07) (pred_3 obj_01 obj_03)
   added: (pred_4 obj_01 obj_09 obj_03)
   goals met: 2 of 3
8. (op_1 obj_01 obj_07 obj_05)
   deleted: (pred_2 obj_01 obj_07)
   added: (pred_2 obj_01 obj_05)
   goals met: 2 of 3
9. (op_2 obj_01 obj_09 obj_05 obj_03)
   deleted: (pred_4 obj_01 obj_09 obj_03)
   added: (pred_1 obj_09 obj_05) (pred_3 obj_01 obj_03)
   goals met: 3 of 3
